//	Напишите программу вычисления суммы четырёх слагаемых.

package by.htp.tsk05;

public class Main {

	public static void main(String[] args) {
		int a = 5, b = 3, c = 8, d = 10, x;
		
		x = a + b + c + d;
		
		System.out.println(x);
	}

}
